{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"data_format": "channels_last", "padding": "valid", "activation": "relu", "activity_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_1", "batch_input_shape": [null, 319, 70, 1], "kernel_regularizer": null, "trainable": true, "strides": [1, 1], "bias_constraint": null, "filters": 32, "kernel_size": [3, 3], "dtype": "float32", "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "padding": "valid", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_1"}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "padding": "valid", "activation": "relu", "activity_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_2", "kernel_regularizer": null, "trainable": true, "strides": [1, 1], "bias_constraint": null, "filters": 64, "kernel_size": [3, 3], "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "padding": "valid", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_2"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "name": "dense_1", "kernel_regularizer": null, "units": 128, "trainable": true, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "name": "dense_2", "kernel_regularizer": null, "units": 3, "trainable": true, "bias_regularizer": null}}], "backend": "tensorflow", "keras_version": "2.1.5"}